runs/damBreak/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
2268
(
(0.00634783 0.00299994 0.0073)
(0.0190435 0.00299993 0.0073)
(0.0317391 0.00299994 0.0073)
(0.0444348 0.00299993 0.0073)
(0.0571304 0.00299993 0.0073)
(0.0698261 0.00299993 0.0073)
(0.0825217 0.00299993 0.0073)
(0.0952174 0.00299993 0.0073)
...
)
;

boundaryField
{
    leftWall
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(0 0.00299993 0.0073)
(0 0.0089998 0.0073)
(0 0.0149997 0.0073)
(0 0.0209995 0.0073)
(0 0.0269994 0.0073)
(0 0.0329993 0.0073)
(0 0.0389992 0.0073)
(0 0.044999 0.0073)
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(0.584 0.00299993 0.0073)
(0.584 0.0089998 0.0073)
(0.584 0.0149997 0.0073)
(0.584 0.0209995 0.0073)
(0.584 0.0269994 0.0073)
(0.584 0.0329993 0.0073)
(0.584 0.0389992 0.0073)
(0.584 0.044999 0.0073)
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<vector> 
62
(
(0.00634783 0 0.0073)
(0.0190435 0 0.0073)
(0.0317391 0 0.0073)
(0.0444348 0 0.0073)
(0.0571304 0 0.0073)
(0.0698261 0 0.0073)
(0.0825217 0 0.0073)
(0.0952174 0 0.0073)
...
)
;
    }
    atmosphere
    {
        type            calculated;
        value           nonuniform List<vector> 
46
(
(0.00634783 0.584 0.0073)
(0.0190435 0.584 0.0073)
(0.0317391 0.584 0.0073)
(0.0444348 0.584 0.0073)
(0.0571304 0.584 0.0073)
(0.0698261 0.584 0.0073)
(0.0825217 0.584 0.0073)
(0.0952174 0.584 0.0073)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
