runs/damBreak/0/Ccx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2268
(
0.00634783
0.0190435
0.0317391
0.0444348
0.0571304
0.0698261
0.0825217
0.0952174
...
)
;

boundaryField
{
    leftWall
    {
        type            calculated;
        value           uniform 0;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.584
0.584
0.584
0.584
0.584
0.584
0.584
0.584
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
62
(
0.00634783
0.0190435
0.0317391
0.0444348
0.0571304
0.0698261
0.0825217
0.0952174
...
)
;
    }
    atmosphere
    {
        type            calculated;
        value           nonuniform List<scalar> 
46
(
0.00634783
0.0190435
0.0317391
0.0444348
0.0571304
0.0698261
0.0825217
0.0952174
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
