runs/damBreak/0/Ccy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2268
(
0.00299994
0.00299993
0.00299994
0.00299993
0.00299993
0.00299993
0.00299993
0.00299993
...
)
;

boundaryField
{
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.00299993
0.0089998
0.0149997
0.0209995
0.0269994
0.0329993
0.0389992
0.044999
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.00299993
0.0089998
0.0149997
0.0209995
0.0269994
0.0329993
0.0389992
0.044999
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
62
(
0
0
0
0
0
0
0
0
...
)
;
    }
    atmosphere
    {
        type            calculated;
        value           nonuniform List<scalar> 
46
(
0.584
0.584
0.584
0.584
0.584
0.584
0.584
0.584
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
