runs/damBreak/0/Ccz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ccz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2268
(
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
...
)
;

boundaryField
{
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
50
(
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
62
(
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
...
)
;
    }
    atmosphere
    {
        type            calculated;
        value           nonuniform List<scalar> 
46
(
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
0.0073
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
